test-on-fara/reports/smoke-test-summary_2026-09-23_17-22.txt
     █ GestureRecognition_HeadPose

       ✓ gestureRecognition · response received
       ✓ gestureRecognition · status in [200]
       ✓ gestureRecognition · no transport error
       ✓ gestureRecognition · body is not empty
       ✓ gestureRecognition · field "status" exists
       ✓ gestureRecognition · field "data.message" exists
       ✓ gestureRecognition · field "data.result" exists
       ✓ gestureRecognition · field "meta.request_id" exists
       ✓ gestureRecognition · array "data.result.predicted_classes" is not empty
       ✓ gestureRecognition · field "status" is integer
       ✓ gestureRecognition · field "data.message" is string
       ✓ gestureRecognition · field "data.result.verified" is boolean
       ✓ gestureRecognition · field "data.result.head_pose" is number
       ✓ gestureRecognition · field "status" equals expected
       ✓ gestureRecognition · field "data.message" equals expected

     assert_failed.......................: 0       0/s
     assert_total........................: 480     39.735715/s
     ✓ { endpoint:gestureRecognition }...: 480     39.735715/s
   ✓ checks..............................: 100.00% ✓ 480       ✗ 0  
     ✓ { type:availability }.............: 100.00% ✓ 128       ✗ 0  
     ✓ { type:contract }.................: 100.00% ✓ 352       ✗ 0  
     data_received.......................: 16 kB   1.3 kB/s
     data_sent...........................: 48 MB   4.0 MB/s
     group_duration......................: avg=1.71s   min=730.4ms  med=1.74s   max=3.81s    p(90)=2.47s    p(95)=2.55s   
     http_req_blocked....................: avg=14.23ms min=0s       med=4.47ms  max=46.67ms  p(90)=30.75ms  p(95)=37.23ms 
     http_req_connecting.................: avg=10.34ms min=0s       med=3.9ms   max=46.67ms  p(90)=30.39ms  p(95)=37.23ms 
   ✓ http_req_duration...................: avg=1.69s   min=722.79ms med=1.72s   max=3.77s    p(90)=2.46s    p(95)=2.53s   
     ✓ { endpoint:gestureRecognition }...: avg=1.69s   min=722.79ms med=1.72s   max=3.77s    p(90)=2.46s    p(95)=2.53s   
       { expected_response:true }........: avg=1.69s   min=722.79ms med=1.72s   max=3.77s    p(90)=2.46s    p(95)=2.53s   
   ✓ http_req_failed.....................: 0.00%   ✓ 0         ✗ 32 
     http_req_receiving..................: avg=2.15ms  min=0s       med=660.5µs max=10.18ms  p(90)=7.2ms    p(95)=7.99ms  
     http_req_sending....................: avg=32.69ms min=1.26ms   med=18.65ms max=173.63ms p(90)=101.73ms p(95)=119.38ms
     http_req_tls_handshaking............: avg=0s      min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting....................: avg=1.65s   min=717.83ms med=1.7s    max=3.67s    p(90)=2.43s    p(95)=2.49s   
   ✓ http_reqs...........................: 32      2.649048/s
     iteration_duration..................: avg=1.71s   min=730.4ms  med=1.74s   max=3.81s    p(90)=2.47s    p(95)=2.55s   
     iterations..........................: 32      2.649048/s
     vus.................................: 1       min=1       max=5
     vus_max.............................: 5       min=5       max=5

======================================================================
             Smoke Test Evaluation Report (Gesture Service)           
======================================================================
Total Duration: 0.20 minutes (12.1 seconds)
Total Requests: 32
Recorded Throughput (RPM): 158.9 requests/minute

── Dual Criteria Check ──
1) Latency p(95) < 3000ms:   [ PASS ✓ ] (Value: 2536.5ms | avg: 1693.0ms | max: 3777.5ms)
2) HTTP Error Rate < 1%:     [ PASS ✓ ] (Value: 0.00%)
3) Checks Success Rate:       100.00%

── Safe Capacity Test Readiness ──
Future Capacity Goal: Higher than 200 requests/minute (> 200 RPM)
Recorded throughput in Smoke Test was 158.9 RPM. To achieve over 200 RPM, incremental load must be applied in the next test.
======================================================================


         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: test-on-fara/smoke-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 40s max duration (incl. graceful stop):
              * gesture_smoke: 5 looping VUs for 10s (gracefulStop: 30s)

INFO[0000] ────────────────────────────────────────────────────────────  source=console
INFO[0000]   Gesture Recognition Smoke Test              source=console
INFO[0000]   Start Time: 2026-09-23T13:52:05.015Z        source=console
INFO[0000]   Server URL: http://gesture-recognition.test.local.farashenasa.ir/gestureRecognition  source=console
INFO[0000]   Target Criteria: p(95) < 3000ms & Error Rate < 1%  source=console
INFO[0000] ────────────────────────────────────────────────────────────  source=console